{
  "author": "Suryadip Sarkar",
  "content": {
    "colors": [
      {
        "key": "sigColorTextPrimary",
        "value": -1
      },
      {
        "key": "sigColorChatChat",
        "value": -256
      },
      {
        "key": "sigColorChatPendingSending",
        "value": -16711681
      },
      {
        "key": "sigColorChatSnapWithSound",
        "value": -26624
      },
      {
        "key": "sigColorChatSnapWithoutSound",
        "value": -16718218
      },
      {
        "key": "actionSheetBackgroundDrawable",
        "value": -13877680
      },
      {
        "key": "actionSheetRoundedBackgroundDrawable",
        "value": -13350562
      },
      {
        "key": "sigColorIconPrimary",
        "value": -256
      },
      {
        "key": "sigExceptionColorCameraGridLines",
        "value": -1
      }
    ]
  },
  "description": "Embrace the Mystery of the Night with the Enigmatic Eclipse Theme! \n  \nStep into a realm where the shadows dance and the stars whisper secrets. The Enigmatic Eclipse theme transforms Snapchat into a captivating nightscape that merges elegance with intrigue. Perfect for night owls and those who appreciate the beauty of darkness, this theme envelops your screen in rich, deep colors that soothe the eyes and inspire creativity.  \n  \n✨ Features:  \n  \nDark Elegance: Enjoy a blend of various colors, that provide an immersive experience while reducing eye strain during late-night browsing.\n \nStunning Visuals: Each color is meticulously crafted to evoke the essence of a celestial event, creating a harmonious blend of aesthetics and functionality. \n\n✅ Why Choose Enigmatic Eclipse? \n \nWith the Enigmatic Eclipse theme, you’ll not only elevate the look of your device but also create an atmosphere that inspires mystery and creativity. Perfect for anyone who loves the allure of the night, this theme invites you to explore the unknown and express your unique style. \n \n⬇️ Download the Enigmatic Eclipse Theme today and transform Snapchat into a mesmerizing nocturnal canvas!",
  "name": "Enigmatic Eclipse",
  "version": "1.0.0"
}